## Missing values
By the end of this lecture you will be able to:
- identify missing values in a `DataFrame`
- count the number of missing values in a column
- find and drop `null` or non-`null` values

In [1]:
import polars as pl
import polars.selectors as cs

### Missing values in Polars
Missing values in Polars are represented with a `null` value for all dtypes. We can create them manually with `None` value.

We create a simple `DataFrame` where the rows have:
- all `null` values
- some `null` values
- one `null` value

In [2]:
df = pl.DataFrame(
    {
        'col1':[None,2,3,4],
        "col2":[None,None,5,6],
        "col3":[None,None,None,7]
    }
)
df

shape: (4, 3)
┌──────┬──────┬──────┐
│ col1 ┆ col2 ┆ col3 │
│ ---  ┆ ---  ┆ ---  │
│ i64  ┆ i64  ┆ i64  │
╞══════╪══════╪══════╡
│ null ┆ null ┆ null │
│ 2    ┆ null ┆ null │
│ 3    ┆ 5    ┆ null │
│ 4    ┆ 6    ┆ 7    │
└──────┴──────┴──────┘

> In Pandas a missing value can be represented with a `null`,`NaN` or `None` value depending on the dtype of the column. Polars also allows `NaN` values for floating point columns to represent non-numberic values (e.g. where division by zero has occurred). This use of `NaN` is distinct from missing values. 

### Metadata on `null` values
Polars stores metadata about `null` values for each column in a `DataFrame`.

#### Null count
Polars stores a count of how many `null` values there are. We can access this with the `null_count` method on a single column or on all the columns

In [3]:
df.null_count()

shape: (1, 3)
┌──────┬──────┬──────┐
│ col1 ┆ col2 ┆ col3 │
│ ---  ┆ ---  ┆ ---  │
│ u32  ┆ u32  ┆ u32  │
╞══════╪══════╪══════╡
│ 1    ┆ 2    ┆ 3    │
└──────┴──────┴──────┘

Polars keeps track of the `null_count` at all times so this is a cheap operation regardless of the size of the column.

### Finding `null` values

We use the `is_null` expression to find out whether each value is `null` and `is_not_null` for the converse

In [5]:
(
    df
    .select(
        [
            pl.col("col1"),
            pl.col("col1").is_null().alias("is_null"),
            pl.col("col1").is_not_null().alias("is_not_null")
        ]
    )
)

shape: (4, 3)
┌──────┬─────────┬─────────────┐
│ col1 ┆ is_null ┆ is_not_null │
│ ---  ┆ ---     ┆ ---         │
│ i64  ┆ bool    ┆ bool        │
╞══════╪═════════╪═════════════╡
│ null ┆ true    ┆ false       │
│ 2    ┆ false   ┆ true        │
│ 3    ┆ false   ┆ true        │
│ 4    ┆ false   ┆ true        │
└──────┴─────────┴─────────────┘

### Filtering by `null` values

#### Filtering on a single column
We can use these methods to filter by `null` or non-`null` values on a single column.

In this example we want all rows where the values in `col1` are not `null`

In [6]:
(
    df
    .filter(
        pl.col("col1").is_not_null(),
    )
)

shape: (3, 3)
┌──────┬──────┬──────┐
│ col1 ┆ col2 ┆ col3 │
│ ---  ┆ ---  ┆ ---  │
│ i64  ┆ i64  ┆ i64  │
╞══════╪══════╪══════╡
│ 2    ┆ null ┆ null │
│ 3    ┆ 5    ┆ null │
│ 4    ┆ 6    ┆ 7    │
└──────┴──────┴──────┘

#### Filtering by `null` values in multiple columns

In this example we want to remove rows where **all** values are `null`. We can do this using:
- `pl.all().is_not_null()` to give `True` values where we get non-`null` values
- `pl.any_horizontal` to find if there is at least one `True` value in a row

In [7]:
df

shape: (4, 3)
┌──────┬──────┬──────┐
│ col1 ┆ col2 ┆ col3 │
│ ---  ┆ ---  ┆ ---  │
│ i64  ┆ i64  ┆ i64  │
╞══════╪══════╪══════╡
│ null ┆ null ┆ null │
│ 2    ┆ null ┆ null │
│ 3    ┆ 5    ┆ null │
│ 4    ┆ 6    ┆ 7    │
└──────┴──────┴──────┘

In [8]:
(
    df
    .filter(
        pl.any_horizontal(pl.all().is_not_null())
    )
)

shape: (3, 3)
┌──────┬──────┬──────┐
│ col1 ┆ col2 ┆ col3 │
│ ---  ┆ ---  ┆ ---  │
│ i64  ┆ i64  ┆ i64  │
╞══════╪══════╪══════╡
│ 2    ┆ null ┆ null │
│ 3    ┆ 5    ┆ null │
│ 4    ┆ 6    ┆ 7    │
└──────┴──────┴──────┘

In this example we want to keep rows where there are no `null` values

In [9]:
(
    df
    .filter(
        pl.all_horizontal(pl.all().is_not_null())
    )
)

shape: (1, 3)
┌──────┬──────┬──────┐
│ col1 ┆ col2 ┆ col3 │
│ ---  ┆ ---  ┆ ---  │
│ i64  ┆ i64  ┆ i64  │
╞══════╪══════╪══════╡
│ 4    ┆ 6    ┆ 7    │
└──────┴──────┴──────┘

### Using the `drop_nulls` method

Polars has a convenience `drop_nulls` method for dropping rows where all values are `null`

In [11]:
(
    df
    .drop_nulls()
)

shape: (1, 3)
┌──────┬──────┬──────┐
│ col1 ┆ col2 ┆ col3 │
│ ---  ┆ ---  ┆ ---  │
│ i64  ┆ i64  ┆ i64  │
╞══════╪══════╪══════╡
│ 4    ┆ 6    ┆ 7    │
└──────┴──────┴──────┘

We can also specify a subset of columns to apply the condition on

In [12]:
(
    df
    .drop_nulls(subset=["col1","col2"])
)

shape: (2, 3)
┌──────┬──────┬──────┐
│ col1 ┆ col2 ┆ col3 │
│ ---  ┆ ---  ┆ ---  │
│ i64  ┆ i64  ┆ i64  │
╞══════╪══════╪══════╡
│ 3    ┆ 5    ┆ null │
│ 4    ┆ 6    ┆ 7    │
└──────┴──────┴──────┘

## Exercises
In the exercises you will develop your understanding of:
- counting the `null` values
- filtering by `null` values

### Exercise 1
Count the number of `null` values in each row of the Titanic data

In [18]:
csv_file = "data_titanic.csv"
(
    pl.read_csv(csv_file)
    .transpose()
    .null_count()
)

shape: (1, 891)
┌──────────┬──────────┬──────────┬──────────┬───┬────────────┬────────────┬────────────┬───────────┐
│ column_0 ┆ column_1 ┆ column_2 ┆ column_3 ┆ … ┆ column_887 ┆ column_888 ┆ column_889 ┆ column_89 │
│ ---      ┆ ---      ┆ ---      ┆ ---      ┆   ┆ ---        ┆ ---        ┆ ---        ┆ 0         │
│ u32      ┆ u32      ┆ u32      ┆ u32      ┆   ┆ u32        ┆ u32        ┆ u32        ┆ ---       │
│          ┆          ┆          ┆          ┆   ┆            ┆            ┆            ┆ u32       │
╞══════════╪══════════╪══════════╪══════════╪═══╪════════════╪════════════╪════════════╪═══════════╡
│ 1        ┆ 0        ┆ 1        ┆ 0        ┆ … ┆ 0          ┆ 2          ┆ 0          ┆ 1         │
└──────────┴──────────┴──────────┴──────────┴───┴────────────┴────────────┴────────────┴───────────┘

Filter out the rows that are `null` from the `Cabin` column and count the null values for all columns again

In [19]:
(
    pl.read_csv(csv_file)
    .drop_nulls(subset=['Cabin'])
    .null_count()
)

shape: (1, 12)
┌─────────────┬──────────┬────────┬──────┬───┬────────┬──────┬───────┬──────────┐
│ PassengerId ┆ Survived ┆ Pclass ┆ Name ┆ … ┆ Ticket ┆ Fare ┆ Cabin ┆ Embarked │
│ ---         ┆ ---      ┆ ---    ┆ ---  ┆   ┆ ---    ┆ ---  ┆ ---   ┆ ---      │
│ u32         ┆ u32      ┆ u32    ┆ u32  ┆   ┆ u32    ┆ u32  ┆ u32   ┆ u32      │
╞═════════════╪══════════╪════════╪══════╪═══╪════════╪══════╪═══════╪══════════╡
│ 0           ┆ 0        ┆ 0      ┆ 0    ┆ … ┆ 0      ┆ 0    ┆ 0     ┆ 2        │
└─────────────┴──────────┴────────┴──────┴───┴────────┴──────┴───────┴──────────┘

### Exercise 2
Find all the rows for which the `Age` is `null`

In [20]:
(
    pl.read_csv(csv_file)
    .filter(
        pl.any_horizontal(pl.col('Age').is_null())
    )

)

shape: (177, 12)
┌─────────────┬──────────┬────────┬───────────────────┬───┬────────────┬────────┬───────┬──────────┐
│ PassengerId ┆ Survived ┆ Pclass ┆ Name              ┆ … ┆ Ticket     ┆ Fare   ┆ Cabin ┆ Embarked │
│ ---         ┆ ---      ┆ ---    ┆ ---               ┆   ┆ ---        ┆ ---    ┆ ---   ┆ ---      │
│ i64         ┆ i64      ┆ i64    ┆ str               ┆   ┆ str        ┆ f64    ┆ str   ┆ str      │
╞═════════════╪══════════╪════════╪═══════════════════╪═══╪════════════╪════════╪═══════╪══════════╡
│ 6           ┆ 0        ┆ 3      ┆ Moran, Mr. James  ┆ … ┆ 330877     ┆ 8.4583 ┆ null  ┆ Q        │
│ 18          ┆ 1        ┆ 2      ┆ Williams, Mr.     ┆ … ┆ 244373     ┆ 13.0   ┆ null  ┆ S        │
│             ┆          ┆        ┆ Charles Eugene    ┆   ┆            ┆        ┆       ┆          │
│ 20          ┆ 1        ┆ 3      ┆ Masselmani, Mrs.  ┆ … ┆ 2649       ┆ 7.225  ┆ null  ┆ C        │
│             ┆          ┆        ┆ Fatima            ┆   ┆            ┆        ┆       ┆          │
│ 27          ┆ 0        ┆ 3      ┆ Emir, Mr. Farred  ┆ … ┆ 2631       ┆ 7.225  ┆ null  ┆ C        │
│             ┆          ┆        ┆ Chehab            ┆   ┆            ┆        ┆       ┆          │
│ 29          ┆ 1        ┆ 3      ┆ O'Dwyer, Miss.    ┆ … ┆ 330959     ┆ 7.8792 ┆ null  ┆ Q        │
│             ┆          ┆        ┆ Ellen "Nellie"    ┆   ┆            ┆        ┆       ┆          │
│ …           ┆ …        ┆ …      ┆ …                 ┆ … ┆ …          ┆ …      ┆ …     ┆ …        │
│ 860         ┆ 0        ┆ 3      ┆ Razi, Mr. Raihed  ┆ … ┆ 2629       ┆ 7.2292 ┆ null  ┆ C        │
│ 864         ┆ 0        ┆ 3      ┆ Sage, Miss.       ┆ … ┆ CA. 2343   ┆ 69.55  ┆ null  ┆ S        │
│             ┆          ┆        ┆ Dorothy Edith     ┆   ┆            ┆        ┆       ┆          │
│             ┆          ┆        ┆ "Dolly…           ┆   ┆            ┆        ┆       ┆          │
│ 869         ┆ 0        ┆ 3      ┆ van Melkebeke,    ┆ … ┆ 345777     ┆ 9.5    ┆ null  ┆ S        │
│             ┆          ┆        ┆ Mr. Philemon      ┆   ┆            ┆        ┆       ┆          │
│ 879         ┆ 0        ┆ 3      ┆ Laleff, Mr.       ┆ … ┆ 349217     ┆ 7.8958 ┆ null  ┆ S        │
│             ┆          ┆        ┆ Kristo            ┆   ┆            ┆        ┆       ┆          │
│ 889         ┆ 0        ┆ 3      ┆ Johnston, Miss.   ┆ … ┆ W./C. 6607 ┆ 23.45  ┆ null  ┆ S        │
│             ┆          ┆        ┆ Catherine Helen … ┆   ┆            ┆        ┆       ┆          │
└─────────────┴──────────┴────────┴───────────────────┴───┴────────────┴────────┴───────┴──────────┘

Find all the rows for which neither the `Age` nor the `Cabin` is `null`.

Use the Selectors API (imported above as `cs`) to select the columns

## Solutions
### Solution to Exercise 1
Count the number of `null` values in each row of the Titanic data

In [25]:
csv_file = "data_titanic.csv"
(
    pl.read_csv(csv_file)
    .null_count()
)

shape: (1, 12)
┌─────────────┬──────────┬────────┬──────┬───┬────────┬──────┬───────┬──────────┐
│ PassengerId ┆ Survived ┆ Pclass ┆ Name ┆ … ┆ Ticket ┆ Fare ┆ Cabin ┆ Embarked │
│ ---         ┆ ---      ┆ ---    ┆ ---  ┆   ┆ ---    ┆ ---  ┆ ---   ┆ ---      │
│ u32         ┆ u32      ┆ u32    ┆ u32  ┆   ┆ u32    ┆ u32  ┆ u32   ┆ u32      │
╞═════════════╪══════════╪════════╪══════╪═══╪════════╪══════╪═══════╪══════════╡
│ 0           ┆ 0        ┆ 0      ┆ 0    ┆ … ┆ 0      ┆ 0    ┆ 687   ┆ 2        │
└─────────────┴──────────┴────────┴──────┴───┴────────┴──────┴───────┴──────────┘

Filter out the rows that are `null` from the `Cabin` column and count the null values for all columns again

In [26]:
(
    pl.read_csv(csv_file)
    .filter(pl.col("Cabin").is_not_null())
    .null_count()
)

shape: (1, 12)
┌─────────────┬──────────┬────────┬──────┬───┬────────┬──────┬───────┬──────────┐
│ PassengerId ┆ Survived ┆ Pclass ┆ Name ┆ … ┆ Ticket ┆ Fare ┆ Cabin ┆ Embarked │
│ ---         ┆ ---      ┆ ---    ┆ ---  ┆   ┆ ---    ┆ ---  ┆ ---   ┆ ---      │
│ u32         ┆ u32      ┆ u32    ┆ u32  ┆   ┆ u32    ┆ u32  ┆ u32   ┆ u32      │
╞═════════════╪══════════╪════════╪══════╪═══╪════════╪══════╪═══════╪══════════╡
│ 0           ┆ 0        ┆ 0      ┆ 0    ┆ … ┆ 0      ┆ 0    ┆ 0     ┆ 2        │
└─────────────┴──────────┴────────┴──────┴───┴────────┴──────┴───────┴──────────┘

### Solution to Exercise 2
Find all the rows for which the `Age` is `null`

In [28]:
csv_file = "data_titanic.csv"
(
    pl.read_csv(csv_file)
    .filter(pl.col("Age").is_null())
    .head()
)

shape: (5, 12)
┌─────────────┬──────────┬────────┬───────────────────────┬───┬────────┬────────┬───────┬──────────┐
│ PassengerId ┆ Survived ┆ Pclass ┆ Name                  ┆ … ┆ Ticket ┆ Fare   ┆ Cabin ┆ Embarked │
│ ---         ┆ ---      ┆ ---    ┆ ---                   ┆   ┆ ---    ┆ ---    ┆ ---   ┆ ---      │
│ i64         ┆ i64      ┆ i64    ┆ str                   ┆   ┆ str    ┆ f64    ┆ str   ┆ str      │
╞═════════════╪══════════╪════════╪═══════════════════════╪═══╪════════╪════════╪═══════╪══════════╡
│ 6           ┆ 0        ┆ 3      ┆ Moran, Mr. James      ┆ … ┆ 330877 ┆ 8.4583 ┆ null  ┆ Q        │
│ 18          ┆ 1        ┆ 2      ┆ Williams, Mr. Charles ┆ … ┆ 244373 ┆ 13.0   ┆ null  ┆ S        │
│             ┆          ┆        ┆ Eugene                ┆   ┆        ┆        ┆       ┆          │
│ 20          ┆ 1        ┆ 3      ┆ Masselmani, Mrs.      ┆ … ┆ 2649   ┆ 7.225  ┆ null  ┆ C        │
│             ┆          ┆        ┆ Fatima                ┆   ┆        ┆        ┆       ┆          │
│ 27          ┆ 0        ┆ 3      ┆ Emir, Mr. Farred      ┆ … ┆ 2631   ┆ 7.225  ┆ null  ┆ C        │
│             ┆          ┆        ┆ Chehab                ┆   ┆        ┆        ┆       ┆          │
│ 29          ┆ 1        ┆ 3      ┆ O'Dwyer, Miss. Ellen  ┆ … ┆ 330959 ┆ 7.8792 ┆ null  ┆ Q        │
│             ┆          ┆        ┆ "Nellie"              ┆   ┆        ┆        ┆       ┆          │
└─────────────┴──────────┴────────┴───────────────────────┴───┴────────┴────────┴───────┴──────────┘

Find all the rows for which either the `Age` or the `Cabin` is `null`

Use the Selectors API (imported above as `cs`) to select the columns

In [29]:
(
    pl.read_csv(csv_file)
    .filter(
        pl.any_horizontal(cs.matches("Age|Cabin").is_null())
    )
    .select(
        cs.matches("Age|Cabin")
    )       
)

shape: (706, 2)
┌──────┬───────┐
│ Age  ┆ Cabin │
│ ---  ┆ ---   │
│ f64  ┆ str   │
╞══════╪═══════╡
│ 22.0 ┆ null  │
│ 26.0 ┆ null  │
│ 35.0 ┆ null  │
│ null ┆ null  │
│ 2.0  ┆ null  │
│ …    ┆ …     │
│ 25.0 ┆ null  │
│ 39.0 ┆ null  │
│ 27.0 ┆ null  │
│ null ┆ null  │
│ 32.0 ┆ null  │
└──────┴───────┘